cases/sphere_Re300/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    arch        "LSB;label=32;scalar=64";
    location    "30.6";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField  uniform 0;

boundaryField
{
    sphere
    {
        type            nutUSpaldingWallFunction;
        value           $internalField;
    }
    "(inlet|outlet)"
    {
        type            calculated;
        value           $internalField;
    }
    "(yp|ym|zp|zm)"
    {
        type            calculated;
        value           $internalField;
    }
}

