cases/sphere_Re300/system/post/UPrim
UPrime
{
    type            subtract;
    libs            (fieldFunctionObjects);

    // Mandatory (inherited) entry (runtime modifiable)
    fields          (U UMean);

    // Optional (inherited) entries
    result          UPrime;
    
    ${/averageControl}; 
    ${/execControl};

}
