cases/sphere_Re300/system/post/average_Up
fieldAverage1
{
    type            fieldAverage;
    libs            (fieldFunctionObjects);

    fields
    (
        U
        {
            mean        yes;
            prime2Mean  yes;
            base        time;
        }
        p
        {
            mean        yes;
            prime2Mean  yes;
            base        time;
       }
    );
    
    ${/averageControl}
}
