cases/sphere_Re300/system/post/modelled_fields
turbulenceFields1
{
    type            turbulenceFields;
    libs            (fieldFunctionObjects);

    fields          (k epsilon);

    ${/averageControl}; 
    ${/execControl};
}
